枪口动作 = [
    [2200101,2205308], # 你好= 吉他情缘
    [2201201,2206408], # 热潮律动= 祈雨
    [2200601,2206508], # 走= 舞双剑
    [2204201,2209808], # 鞠躬= 剑影腾飞
    [2200701,2203508], # 不行= 蔬菜动物精灵
    [2201401,2203308], # 俄舞= 魔法变身
    [2204101,2200990], # 触电= 巅峰宗师动作
    [2212901,2233608], # 抓狂= 破局之力
]

枪械 = [
    [20300800,100405803], # M416机械瞄具= M416-至情至圣(机瞄)
    [29100400,100405802], # M416突击步枪默认弹匣= M416-至情至圣(弹匣)
    [28100400,100405801], # M416突击步枪默认枪口= M416-至情至圣(枪口)
    [20401100,100405720], # 扩容弹匣(步枪,机枪)= M416-至情至圣(扩容弹匣)
    [20401300,100405719], # 快速扩容弹匣(步枪,机枪)= M416-至情至圣(快速扩容)
    [20200700,100405722], # 激光瞄准器= M416-至情至圣(激光瞄准)
    [20200100,100405724], # 直角前握把= M416-至情至圣(直角握把)
    [20200200,100405725], # 垂直握把= M416-至情至圣(垂直握把)
    (20300100, 100605011),  # 红点瞄准镜= AUG-星梦奇缘(红点瞄准镜)
    (20300200, 100605012),  # 全息瞄准镜= AUG-星梦奇缘(全息瞄准镜)
    (20300300, 100605013),  # 2倍瞄准镜= AUG-星梦奇缘(2倍瞄准镜)
    (20301400, 100605014),  # 3倍瞄准镜= AUG-星梦奇缘(3倍瞄准镜)
    (20300400, 100605015),  # 4倍瞄准镜= AUG-星梦奇缘(4倍瞄准镜)
    (20301500, 100605016),  # 6倍瞄准镜= AUG-星梦奇缘(6倍瞄准镜)
    (20301800, 100605017),  # 侧面瞄准镜= AUG-星梦奇缘(侧面瞄准镜)
    [20409100, 905515], # 枪口补偿器(步枪)= 星梦奇缘-击杀击中特效
    [20409200, 905516], # 消焰器(步枪)= 电糖天使-击杀击中特效
    [20409300, 905521], # 消音器(步枪)= 宇宙意志-击杀击中特效
    [20100900,100405527], # 枪口补偿器(步枪)= M416-至情至圣(枪口补偿)
    [20101000,100405628], # 消焰器(步枪)= M416-至情至圣(消焰器)
    [20200400,100405723], # 轻型握把= M416-至情至圣(轻型握把)
    [20200500,100405721], # 半截式握把= M416-至情至圣(半截式握把)
    [20200600,100405726], # 拇指握把= M416-至情至圣(拇指握把)
    [20300500,301200717], # 8倍瞄准镜= AMR-炫光之旅(8倍瞄准镜)
    [20400400,200201902], # 扩容弹匣(冲锋枪,手枪)= UMP45-雪国精灵(弹匣)
    [20400500,200201919], # 快速弹匣(冲锋枪,手枪)= UMP45-雪国精灵(快速扩容)
    [20100200,905503], # 枪口补偿器(冲锋枪)= 仙履奇缘-击杀击中特效
    [20100400,905502], # 消焰器(冲锋枪)= 平天焚空-击杀击中特效
    [20100600,905146], # 消音器(冲锋枪,手枪)= TTHB-防御效果
    [20100600,905504], # 消音器(冲锋枪,手枪)= 玉魂晶魄-击杀击中特效
    [10100500,101005052], # -GROZA-巴啦啦小魔仙
    [10100600,101006053], # -AUG-星梦奇缘
    [10100700,101007012], # -QBZ-相思残雪
    [10100800,101008060], # -M762-电糖天使
    [10100900,101009006], # -MK47-洛神天依
    [10101000,101010022], # -G36C-镜域双华
    [10101100,101011012], # -AC-VAL-梦海之灵
    [10101200,101012010], # -蜜獾-白蛇盈舞
    [10100400,101004058], # -M416-至情至圣
    [10100300,101003058], # -SCAR-L-天蓬元帅
    [10100100,101001116], # -AKM-幽焰骑士
    [10501000,105010004], # -MG3-洛神天依
    [10210500,102105039], # -P90-金丰海韵
    [10200200,102002019], # -UMP45-雪国精灵
    [10200300,102003024], # -Vector-环太平洋
    [10200400,102004027], # -汤姆逊-荒漠赏金
    [10200700,102007001], # -MP5K-甜蜜誓约
    [10200800,102008001], # -AKS-74U-白蛇盈舞
    [10300100,103001056], # -Kar98K-圣光天使
    [10300200,103002012], # -M24-星之信仰
    [10300300,103003036], # -AWM-璀璨巨星
    [10101300,101013009], # -Famas-初号机觉醒Ve
    [10300500,103005017], # -VSS-烈焰拳霸
    [10300800,103008009], # -Win94-萝萝小趴兔
    [10300900,103009010], # -SLR-暗夜玫瑰
    [10301000,103010007], # -QBU-甜心娃娃
    [10301100,103011008], # -莫辛纳甘-兔兔小魔女
    [10301200,103012010], # -AMR-超新星
    [10301300,103013005], # -M417-第五大道
    [10301400,103014005], # -MK20-H-海螺星光
    [10301500,103015025], # -M200-梦海之灵
    [10310000,103100002], # -MK12-游龙飞鱼
    [10400200,104002018], # -S1897-千面幻镜
    [10400300,104003014], # -S12K-香水柠檬
    [10400500,104005002], # -AA12-G-萌物绒绒
    [10410000,104100007], # -SPAS-12-音爆索尼克
    [10500100,105001022], # -M249-蓝莓炮弹
    [10500200,105002037], # -DP-28-金蝉行者
    [10200100,102001045], # -UZI-畅跳缤纷
    [10700700,107007014], # 爆炸猎弓= 爆炸猎弓-精灵
    [60200400,602004023], # 破片手榴弹= 破片手榴弹-秋玉花灯
    [60200200,602002004], # 烟雾弹= 烟雾弹-糯粉咩咩
    [10800400,108004069], # 平底锅= 平底锅-纯梦嫁纱
    [10800200,108002002], # 撬棍= 撬棍-快乐主宰
    [10800100,108001009], # 大砍刀= 大砍刀-青龙偃月刀
    [10701000,107010002], # 突击盾牌= 突击盾牌-万古烈焰
]

皮肤载具 = [
    [335000100, 335000700],  # 马的三个颜色
    [330800200, 330800400],  # 双人摩托棕色=火箭少女摩托
    [332500100, 332500500],  # PG-117快艇= 快艇-自由的鲸
    [330800100, 330801800],  # 双人摩托(黑)= 幽焰风驰摩托车
    [330100100, 330102500],  # buggy沙滩车(黑)= 紫霄星驰(炫晶紫)
    [334900100, 334900200],  # 4座敞篷跑车= 宾利GT敞篷（火焰橘）
    [330400100, 330403400],  # UAZ越野车= 乔治·巴顿战车(辉煌金)
    [330200100, 330404400],  # 布篷UAZ越野车= 仰望U8(雷霆紫)
    [330300100, 330401300],  # 敞篷UAZ越野车= 兰博基尼URUS(炫光金)
    [330100200, 330100800],  # buggy沙滩车(黄)= 合金龙骨（红）
    [330900100, 330900300],  # 三人摩托(黑)= 鬼马风驰
    [330900200, 330900400],  # 三人摩托(棕)= 拉轰鸭鸭车
    [333600100, 333603900],  # 2座跑车CoupeRB= 帕加尼imola(星空蓝)
    [330600100, 330602900],  # Dacia轿车(蓝)= 玛莎拉蒂Quattroporte
    [330600200, 330602700],  # Dacia轿车(红)= 玛莎拉蒂Quattroporte
    [330600300, 330603400],  # Dacia轿车(白)= 宾利飞驰(皇家紫)
    [401046, 401309],        # 蓝色童趣帽子= 星之信仰头饰
    [401029, 401188],        # 红色童趣帽子= 深海小丑鱼头饰
    [401030, 401211],        # 黑色童趣帽子= 怪诞乔克头饰
    [403211, 413407],        # 蓝色运动上衣= 金戈铁马套装
    [403210, 413677],        # 黄色运动上衣= 精灵之光-露米娜
    [403209, 413562],        # 红色运动上衣= 镜域双华-欧若拉
    [403228, 413548],        # 黑色伏地魔上衣= 墨龙九天-敖渊
    [403227, 413606],        # 白色伏地魔上衣= 梦海之灵-妮芮妲
    [403226, 413656],        # 黄色伏地魔上衣= 宇宙意志-塞卢姆
    [403354, 413619],        # 黄色名流上衣= 幽焰骑士-维塔
    [403353, 413739],        # 湖蓝色名流上衣= 幽焰骑士-维塔
    [403200, 413740],        # 酒红色名流上衣= 幽焰骑士-维塔
    [403199, 403971],        # 深蓝色名流上衣= 闪耀迪迦角色
    [403432, 413258],        # 人气偶像上衣= 女娲后裔-赵灵儿
    [403431, 403600],        # 完美偶像上衣= 天网终结者
    [403379, 403524],        # 怒火燎原上衣= 深海小丑鱼套装
    [403192, 413064],        # 猛禽上衣= 零号机款机体服
    [403198, 413063],        # 竞技名士外套= 初号机款机体服
    [403197, 413660],        # 橘黑制服上衣= 狂花道·不知火舞角色
    [403058, 403638],        # 特训学院上衣= 雪国幻梦套装
    [401045, 401282],        # 酒红色名流帽子= 雪国幻梦头饰
    [401028, 40609006],      # 深蓝色名流帽子= 甜心巧克力头发
    [401088, 401846],        # 湖蓝色名流帽子= 甜蜜旋律头饰
    [401090,66100002],        # 灰色游荡者无檐帽=治疗持效
    [403115, 403577],        # 最强战友T恤(白)= 花面小丑上衣
    [403370, 413036],        # 短款白绿羽绒服= AG追光队服
    [403371, 453021],        # 短款蓝白羽绒服= 火箭少女101粉色套装
    [403434, 403938],        # 幻影武者上衣= 绚金战神套装
    [401089, 401309],        # 黄色名流帽子= 星之信仰头饰
    [407001, 407041],        # 深蓝色名流遮阳镜= 暗影哥特眼罩
    [407002,66090002],        # 酒红色名流遮阳镜=跳跃持效
    [403193, 411055],        # 青年教官上衣= 激战未来
    [402055, 402068],        # 冷焰舞者口罩= 都市猎人面罩
    [404107, 404232],        # 卡其色运动短裤= 浪漫天命下衣
    [404084, 404123],        # 黑色运动短裤= 赤蝎幽灵长裤
    [404106, 404049],        # 紫色运动短裤= S1赛事裤
    [404100, 404323],        # 黑色伏地魔长裤= 胖达团团下装
    [405059, 405286],        # 红色运动鞋= 摇滚狂鲨拖鞋
    [405044,66040002],       # 黑色运动鞋=冲刺特效
    [405055, 405292],        # 白色伏地魔鞋子= 激萌罗小黑鞋子
    [502004, 502001012],     # 摩托车头盔(1级), 国宝胖达头盔(1级)
    [502005, 502002012],     # 军用头盔(2级), 国宝胖达头盔(2级)
    [502001, 502001012],     # 摩托车头盔(1级), 国宝胖达头盔(1级)
    [502002, 502002012],     # 军用头盔(2级), 国宝胖达头盔(2级)
    [502003, 502003012],     # 特种部队头盔(3级), 国宝胖达头盔(3级)
    [501001, 501001009],     # 背包(1级), 萌熊伴侣背包(1级)
    [501002, 501002009],     # 背包(2级), 萌熊伴侣背包(2级)
    [501003, 501003009],     # 背包(3级), 萌熊伴侣背包(3级)
    [501004, 501001077],     # 背包(1级), 动感兔斯基背包(1级)
    [501005, 501002077],     # 背包(2级), 动感兔斯基背包(2级)
    [501006, 501003077],     # 背包(3级), 动感兔斯基背包(3级)
    [400986, 401997],        # 修复秃头
    [40603001, 40609037],  # 头发01（咖啡色）=梦幻火箭头发
    [40603002, 40609006],  # 头发02（咖啡色）=巧克力头发
    [40603003, 40609054],  # 头发03（咖啡色）=怪诞杰克头发
    [40603004, 40609010],  # 头发04（咖啡色）=雪国幻梦头发
    [40603005, 40609500],  # 头发05（咖啡色）=灵感创作师头发
    [40603006, 40609052],  # 头发06（咖啡色）=小丑鱼头发
    [40603007, 40609185],  # 头发07（咖啡色）=馨动时刻头发
    [40603008, 40609144],  # 头发08（咖啡色）=缤纷油彩头发
    [40603009, 40609114],  # 头发09（咖啡色）=大橘为重头发
    [40603010, 40609532],  # 头发10（咖啡色）=赵灵儿头发
    [40603011, 40609597]   # 头发11（咖啡色）=白勺头

]
